АлогистикТест2/src/Documents/алк_ПриемкаЛесопродукции/алк_ПриемкаЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПриемкаЛесопродукции</name>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииТД</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииГОСТ</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.рфп_ОтгрузкаВагона</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСортировки</name>
    <type>
      <types>DocumentRef.алк_СортировкаЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагона</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДоСотых</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКУчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКУчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатПроизводителя</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.алк_Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладнойРейса</name>
    <comment>Номер накладной рейса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролер_1</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер_2</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладнойВРег</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагонаВРег</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанВЕРП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаЛесопродукции</name>
    <type>
      <types>EnumRef.РФП_ВидыСортировкиЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Буфер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пиловочник</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПиловочникСортировка</name>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрВершиныФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычетНаКору</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПиловочникОУ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПиловочникГОСТ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемГруппы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем_т3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеНастройки/алк_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_СтатусыВходящейОтгрузки/алк_СтатусыВходящейОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыВходящейОтгрузки</name>
  <enumValues>
    <name>ВПути</name>
    <comment>Выехал с пункта отправления</comment>
  </enumValues>
  <enumValues>
    <name>Прибыл</name>
    <comment>Транспорт приехал на АЛК</comment>
  </enumValues>
  <enumValues>
    <name>Разгружен</name>
    <comment>Разгрузиди несортированную</comment>
  </enumValues>
  <enumValues>
    <name>Принят</name>
    <comment>Оформлен акт приемки</comment>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПриемкаЛесопродукции/ObjectModule.bsl
#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	
	РфпЗаполнениеОбъектов.ЗаполнитьДокумент(ЭтотОбъект);
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)                            
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	//Движения.алк_ОстаткиНесортированного.Очистить();
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_ПриемкаЛесопродукции.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	
	// Отражение в разделах учета
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьУчетЛесопродукцииГОСТ(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьУчетЛесопродукцииТД(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьОстаткиНесортированного(ДополнительныеСвойства, Движения, Отказ);
	
	//Сергеева Г.О. Оборотный регистр ++
	РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ);
	//Сергеева Г.О. Оборотный регистр --
	
	//Сергеева Г.О. ++
	РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
	//Сергеева Г.О. --
	
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --
	
	// Отражение по "Последовательностям"
	РфпСервер.ОтразитьДокументыПоследовательностиБиржа(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть(); 
	
	// Контроль
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);
	// 
	
	// отключение контроля в настройках
	
	СтруктураОтбора = Новый Структура("Параметр", "ОтключитьКонтрольПриемка");
	НастройкаКонтроля = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураОтбора);
	
	КонтролькВыключен = Ложь;
	
	Если НастройкаКонтроля.Количество() > 0 Тогда
		КонтролькВыключен = НастройкаКонтроля[0].Булево;
	КонецЕсли;
	
	Если КонтролькВыключен Тогда  	
		Отказ = Ложь;
	КонецЕсли; 
	
	// 

	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СортБаланс = Справочники.Сорта.НайтиПоКоду("000000011", Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
	СортДрова = Справочники.Сорта.НайтиПоКоду("000000012", Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
		
	Если Не ЗначениеЗаполнено(ДатаСмены) Или Не ЗначениеЗаполнено(Смена) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнены параметры смены!";
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	Для каждого стрОУ Из ПиловочникОУ Цикл
		
		Если Не стрОУ.Штабель.Несоответствие И стрОУ.Сорт = СортДрова Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не корректно указан штабель!";
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Для каждого стрОУ Из ПиловочникГОСТ Цикл
		
		Если стрОУ.Основная Тогда
			Продолжить;	
		КонецЕсли; 
	
		Если Не стрОУ.Штабель.Несоответствие И стрОУ.Сорт = СортДрова Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не корректно указан штабель!";
			Сообщение.Сообщить(); 
			
			Прервать;
			
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Партия) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка записи! Поле ""Партия"" должно быть обязательно заполнено, выберите входящую отгрузку из списка, или создайте входящую отгрузку вручную",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	НомерНакладнойВрег = Врег(СтрЗаменить(НомерНакладной, " ", "")); 
	НомерВагонаВРег = Врег(СтрЗаменить(НомерВагона, " ", "")); 
	
	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
		
		Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
		
	КонецЕсли; 
	
	ЗаполнитьХарактеристикиНаСервере();
	ОбъемКУчету = ПиловочникГОСТ.Итог("Объем");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(Партия) Тогда
		
		РезультатПроверки = ПроверитьПартиюНаДубли();
		
		Если РезультатПроверки <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Ошибка проведения! Обнаружено несколько актов приемки по одной партии! %1", СтрСоединить(РезультатПроверки, ", ")),,,,Отказ); 
			
		ИначеЕсли Не Партия.Проведен тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Ошибка проведения! Для проведения приемки лесопродукции, документ %1 должен быть проведен", Партия),,,, Отказ)
			
		КонецЕсли;  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
		
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
		
	КонецЕсли; 		
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Обработка","алк_УправлениеПоследовательностями") Тогда 
		Возврат;
	КонецЕсли;   
	
	Если ДополнительныеСвойства.Свойство("Обработка","УниверсальныеПодборИОбработкаОбъектовУФ") Тогда 
		Возврат;
	КонецЕсли;
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	алк_ОценкаСырьяПродукция.Ссылка
	//|ИЗ
	//|	Документ.алк_ОценкаСырья.Продукция КАК алк_ОценкаСырьяПродукция
	//|ГДЕ
	//|	алк_ОценкаСырьяПродукция.Партия = &Партия
	//|	И алк_ОценкаСырьяПродукция.Ссылка.Проведен
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	алк_ОценкаСырьяПродукция.Ссылка";
	//
	//Запрос.УстановитьПараметр("Партия", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	Сообщить("Изменения документа запрещены! Требуется отменить проведение документа: " + ВыборкаДетальныеЗаписи.Ссылка);		
	//	Отказ = Истина;
	//	Возврат;
	//КонецЦикла; 
	
	Если Партия.Статус = Перечисления.алк_СтатусыВходящейОтгрузки.ВПути 
		или Партия.Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл 
		или Не ЗначениеЗаполнено(Партия.Статус) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("В выбранной партии %1 должен быть установлен статус ""Разгружен"". Невозможно отсортировать не разгруженный транспорт.", Партия)
			, Партия, "Партия", "Объект.Партия", Отказ);
	ИначеЕсли ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(Партия, Перечисления.алк_СтатусыВходящейОтгрузки.Принят);
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)   
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства); 
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПиФ

Функция ПроверитьПартиюНаДубли()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПриемкаЛесопродукции.Ссылка как Ссылка
	|ИЗ
	|	Документ.алк_ПриемкаЛесопродукции КАК алк_ПриемкаЛесопродукции
	|ГДЕ
	|	алк_ПриемкаЛесопродукции.Проведен
	|	И алк_ПриемкаЛесопродукции.Партия = &Партия
	|	И алк_ПриемкаЛесопродукции.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Партия", ЭтотОбъект.Партия);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
КонецФункции // ПроверитьПартиюНаДубли()

&НаСервере
Процедура ЗаполнитьХарактеристикиНаСервере()
	
	пвхПорода  = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
	пвхСорт    = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт);
	пвхДлина   = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина);
	пвхСечение = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение);
	
	Для каждого стрПиловочникУ Из ПиловочникОУ Цикл 
		
		Если стрПиловочникУ.Основная Тогда
			Продолжить;	
		КонецЕсли; 
		
		ТаблицаСвойств = Новый ТаблицаЗначений;
		ТаблицаСвойств.Колонки.Добавить("Свойство");
		ТаблицаСвойств.Колонки.Добавить("Значение");
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхПорода;
		НоваяСтрока.Значение = стрПиловочникУ.Порода;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхСорт;
		НоваяСтрока.Значение = стрПиловочникУ.Сорт;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхДлина;
		НоваяСтрока.Значение = стрПиловочникУ.Длина;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхСечение;
		НоваяСтрока.Значение = стрПиловочникУ.Сечение;
		
		стрПиловочникУ.Характеристика = АлгоритмыСвойстваИХарактеристики.ПолучитьХарактеристикуПоПараметрам(стрПиловочникУ.Номенклатура, ТаблицаСвойств);
				
		Если Не ЗначениеЗаполнено(стрПиловочникУ.Характеристика) Тогда 
			
			Если ЗначениеЗаполнено(стрПиловочникУ.Порода) 
				И ЗначениеЗаполнено(стрПиловочникУ.Сорт)
				И ЗначениеЗаполнено(стрПиловочникУ.Длина)
				И ЗначениеЗаполнено(стрПиловочникУ.Сечение) Тогда

					стрПиловочникУ.Характеристика = АлгоритмыСвойстваИХарактеристики.СоздатьХарактеристикуПоНаборуСвойств(стрПиловочникУ.Номенклатура, ТаблицаСвойств);			
			
			КонецЕсли;		
				
		КонецЕсли;
		
		//стрПиловочникУ.Характеристика = Характеристика; 
		
		Если стрПиловочникУ.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не найдена характеристика: Порода - " + стрПиловочникУ.Порода + " Сорт - " + стрПиловочникУ.Сорт +
			" Длина - " + стрПиловочникУ.Длина + " Сечение - " + стрПиловочникУ.Сечение;
			Сообщение.Сообщить();
			
		КонецЕсли;  
	
	КонецЦикла; 
	
	Для каждого стрПиловочникГОСТ Из ПиловочникГОСТ Цикл
		
		Если стрПиловочникГОСТ.Основная Тогда
			Продолжить;	
		КонецЕсли; 
		
		ТаблицаСвойств = Новый ТаблицаЗначений;
		ТаблицаСвойств.Колонки.Добавить("Свойство");
		ТаблицаСвойств.Колонки.Добавить("Значение");
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхПорода;
		НоваяСтрока.Значение = стрПиловочникГОСТ.Порода;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхСорт;
		НоваяСтрока.Значение = стрПиловочникГОСТ.Сорт;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхДлина;
		НоваяСтрока.Значение = стрПиловочникГОСТ.Длина;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхСечение;
		НоваяСтрока.Значение = стрПиловочникГОСТ.Сечение;
		
		стрПиловочникГОСТ.Характеристика = АлгоритмыСвойстваИХарактеристики.ПолучитьХарактеристикуПоПараметрам(стрПиловочникГОСТ.Номенклатура, ТаблицаСвойств); 
		
		Если Не ЗначениеЗаполнено(стрПиловочникГОСТ.Характеристика) Тогда 
			
			Если ЗначениеЗаполнено(стрПиловочникГОСТ.Порода) 
				И ЗначениеЗаполнено(стрПиловочникГОСТ.Сорт)
				И ЗначениеЗаполнено(стрПиловочникГОСТ.Длина)
				И ЗначениеЗаполнено(стрПиловочникГОСТ.Сечение) Тогда

					стрПиловочникГОСТ.Характеристика = АлгоритмыСвойстваИХарактеристики.СоздатьХарактеристикуПоНаборуСвойств(стрПиловочникГОСТ.Номенклатура, ТаблицаСвойств);			
			
			КонецЕсли;
				
		КонецЕсли;
					
			
		Если стрПиловочникГОСТ.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка") Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не найдена характеристика: Порода - " + стрПиловочникГОСТ.Порода + " Сорт - " + стрПиловочникГОСТ.Сорт +
			" Длина - " + стрПиловочникГОСТ.Длина + " Сечение - " + стрПиловочникГОСТ.Сечение;
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	
КонецПроцедуры

#КонецОбласти
